; domain
(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y))))

; problem
(define (problem BLOCKS-13-0)
  (:domain BLOCKS)
  (:objects L H E A J C D F G K M I B - block)
  (:init (clear B) (clear I) (clear M)
         (ontable K) (ontable G) (ontable M)
         (on B F) (on F D) (on D C) (on C J) (on J A) (on A E)
         (on E H) (on H L) (on L K) (on I G)
         (handempty))
  (:goal (and (on G I) (on I C) (on C D) (on D F) (on F A) (on A M)
              (on M H) (on H E) (on E L) (on L J) (on J B) (on B K)))
)

; plan
1. (unstack b f)
   deleted: (clear b) (handempty) (on b f)
   added: (holding b) (clear f)
   goals met: 0 of 12
2. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 0 of 12
3. (unstack f d)
   deleted: (clear f) (handempty) (on f d)
   added: (holding f) (clear d)
   goals met: 0 of 12
4. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 0 of 12
5. (unstack d c)
   deleted: (clear d) (handempty) (on d c)
   added: (holding d) (clear c)
   goals met: 0 of 12
6. (stack d i)
   deleted: (holding d) (clear i)
   added: (clear d) (handempty) (on d i)
   goals met: 0 of 12
7. (unstack c j)
   deleted: (clear c) (handempty) (on c j)
   added: (holding c) (clear j)
   goals met: 0 of 12
8. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 0 of 12
9. (unstack j a)
   deleted: (clear j) (handempty) (on j a)
   added: (holding j) (clear a)
   goals met: 0 of 12
10. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 0 of 12
11. (unstack a e)
   deleted: (clear a) (handempty) (on a e)
   added: (holding a) (clear e)
   goals met: 0 of 12
12. (stack a f)
   deleted: (holding a) (clear f)
   added: (clear a) (handempty) (on a f)
   goals met: 0 of 12
13. (unstack e h)
   deleted: (clear e) (handempty) (on e h)
   added: (holding e) (clear h)
   goals met: 0 of 12
14. (stack e c)
   deleted: (holding e) (clear c)
   added: (clear e) (handempty) (on e c)
   goals met: 0 of 12
15. (unstack h l)
   deleted: (clear h) (handempty) (on h l)
   added: (holding h) (clear l)
   goals met: 0 of 12
16. (stack h d)
   deleted: (holding h) (clear d)
   added: (clear h) (handempty) (on h d)
   goals met: 0 of 12
17. (unstack l k)
   deleted: (clear l) (handempty) (on l k)
   added: (holding l) (clear k)
   goals met: 0 of 12
18. (stack l e)
   deleted: (holding l) (clear e)
   added: (clear l) (handempty) (on l e)
   goals met: 0 of 12
19. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 0 of 12
20. (stack b k)
   deleted: (holding b) (clear k)
   added: (clear b) (handempty) (on b k)
   goals met: 1 of 12
21. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 1 of 12
22. (stack j b)
   deleted: (holding j) (clear b)
   added: (clear j) (handempty) (on j b)
   goals met: 2 of 12
23. (unstack l e)
   deleted: (clear l) (handempty) (on l e)
   added: (holding l) (clear e)
   goals met: 2 of 12
24. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 3 of 12
25. (unstack e c)
   deleted: (clear e) (handempty) (on e c)
   added: (holding e) (clear c)
   goals met: 3 of 12
26. (stack e l)
   deleted: (holding e) (clear l)
   added: (clear e) (handempty) (on e l)
   goals met: 4 of 12
27. (unstack h d)
   deleted: (clear h) (handempty) (on h d)
   added: (holding h) (clear d)
   goals met: 4 of 12
28. (stack h e)
   deleted: (holding h) (clear e)
   added: (clear h) (handempty) (on h e)
   goals met: 5 of 12
29. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 5 of 12
30. (stack m h)
   deleted: (holding m) (clear h)
   added: (clear m) (handempty) (on m h)
   goals met: 6 of 12
31. (unstack a f)
   deleted: (clear a) (handempty) (on a f)
   added: (holding a) (clear f)
   goals met: 6 of 12
32. (stack a m)
   deleted: (holding a) (clear m)
   added: (clear a) (handempty) (on a m)
   goals met: 7 of 12
33. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 7 of 12
34. (stack f a)
   deleted: (holding f) (clear a)
   added: (clear f) (handempty) (on f a)
   goals met: 8 of 12
35. (unstack d i)
   deleted: (clear d) (handempty) (on d i)
   added: (holding d) (clear i)
   goals met: 8 of 12
36. (stack d f)
   deleted: (holding d) (clear f)
   added: (clear d) (handempty) (on d f)
   goals met: 9 of 12
37. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 9 of 12
38. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 10 of 12
39. (unstack i g)
   deleted: (clear i) (handempty) (on i g)
   added: (holding i) (clear g)
   goals met: 10 of 12
40. (stack i c)
   deleted: (holding i) (clear c)
   added: (clear i) (handempty) (on i c)
   goals met: 11 of 12
41. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 11 of 12
42. (stack g i)
   deleted: (holding g) (clear i)
   added: (clear g) (handempty) (on g i)
   goals met: 12 of 12
